app/controllers/authentications_controller.rb

INSERT INTO "users" ("username", "email", "password_digest") VALUES ($1, $2, $3) RETURNING "id"  [["username", "jon"], ["email", "jonnie@jonnie.com"], ["password_digest", "$2a$10$bUwIMSoGDsyt4NsHMB4N6OyNCkJPFoGcJShgSyYWZcv.HoGPzmFXW"]]
---
  def register
    user = User.new(user_params)
    if user.save