app/controllers/drinks_controller.rb

INSERT INTO "drinks" ("user_id", "name", "quantity", "units", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @drink = Drink.new(drink_params)

    if @drink.save